{"blogpage":[{"id":"014","heading":"The race","para":"The race started off with road bikes starting first with a neutral section of around half a km, and hybrid/mtb category bikes starting a minute later. We thank the organizers for considering our requests for a start like this, as some racers tend to make use of the mess at the start of the race and make attacks and make it messier.However there was a surprise for us, just when the race got started as the organizers had put a pair of timing humps on the left side of road and there was total mess with a police car not moving out on time. It was total chaos and I decided to give that timing hump a miss than crashing, but some of the riders crashed badly there, including one of our strong team mate Rojan Varghese. Those timing humps were put on the fastest stretch of the race, and it was a pain going through them every single lap, with water bottles popping out. (There is a better way to keep the timing devices as done by the MVS criterium folks and BBCH folks).In the first lap, as we had already decided, Shaun was to take us down the downhill safely. The newbies in our team, Azim and Mahesh, had an adrenaline rush and they were doing all out efforts at front with others drafting behind them. I am sure they will eventually learn a mass start race is about conserving as much as possible and keeping your head down and staying behind others.","imglocation":".images/atr1.jpg"}],"comments":[{"comment":"To effectively manage a national park unit and plan for its future, a basic understanding of a park's resources, values, and history is needed - a foundation for planning and management. These are called foundation documents. Foundation documents are at the core of each park's planning portfolio. ","name":"lekha"},{"comment":"Even if we have to step out of home to visit someone 100 meters away, all these has to be worn, which basically means nobody steps out of their buildings unless absolutely necessary and the streets are mostly deserted during winter.","name":"kochus","file":"blog4.json"}]}