{"blogpage":[{"id":"011","heading":"National Park Adventures","para":"In the morning we went out to pick up our rented car, which was a 7 seater Volkswagen Touran I hear this car is getting released and also getting trolled in kerala for its second name. The rental guy asked us to come to Oulu railway station where the papers were signed and credit card was swiped in a coffee shop table. Aliyan and I was hoping to take turns and drive Ajiyannans old car, which was a 5 seater Audi station wagon. (A station wagon is a sedan with its trunk made like a hatchback to give additional space. Most of the sedans are released here as station wagon mostly because people want to take a lot of stuff, including their dogs in the back of the car. Also an Audi is a poor mans car here). Ajiyannan added both of us also as drivers to the Volkswagen as well, paying extra Euros for same. The Touran was an automatic car with lot of sensors and stuff, so Ajiyannan asked us to drive that car and since it is so easy to drive. We would have preferred to crash the old Audi instead of the new Touran, but Ajiyannan insisted so I took to the wheels of Touran. Now for all people to get out of a house here, it will take nearly 1 hour to get ready after we have put our normal clothes. That is to wear the sweaters, jackets, boots, caps, gloves etc not only for us but for the kids as well. Kids needs to get into an overall jacket that is a one set jacket from top to bottom. Getting the babies to wear these overalls and shoes is quite a task.  Even if we have to step out of home to visit someone 100 meters away, all these has to be worn, which basically means nobody steps out of their buildings unless absolutely necessary and the streets are mostly deserted during winter.","imglocation":".images/atr1.jpg"}],"comments":[{"comment":"To effectively manage a national park unit and plan for its future, a basic understanding of a park's resources, values, and history is needed - a foundation for planning and management. These are called foundation documents. Foundation documents are at the core of each park's planning portfolio. ","name":"lekha"},{"comment":"I had raced the same race last year, and struggled to keep myself with the main peloto, eventually had got dropped at around 60KM. I had trained a bit since then and also upgraded to lighter wheels, so I was confident of finishing with the peloton. So for me the goals for this race were to ride more aggressively, stay towards the front of the peloton, try an attack or join attacks  etc.  (yeah I missed chasing down attacks in the goal list :)).","name":"Ajith"}]}