{"blogpage":[{"id":"012","heading":"The story of our first 200KM","para":"This is the story of our first 200KM Brevet. We, the bikers at TBC, were talking about doing a brevet for more than an year now and finally our dreams materialized on Nov 29th 2014, thanks to the hard work of a few TBCians.The event is organized under Audax India Randonneurs which is working under the world wide governing body for Randonneuring – Audax Club Parisen – Paris. This is organized under international rules and is a qualifier for the legendary Paris – Brest – Paris, 1200 KM brevet which happens in Paris every 4 years.The route was set to be scenic, winding and going up and down for the first 150 KM. The initial half was the most scenic and toughest terrain, mostly going through good country roads, near the Thenamala forest region.  There were some long climbs, some might be CAT4, which extended for 1-2 KMs. The overall elevation, is always a matter of debate, as the GPS based maps shows overall elevation close to 2500m, while my Garmin with an altimeter (battery bonked at 160KM), showed around 1700m till 160k and the last part was mostly flat. So although the overall elevation was the normal Trivandrum standard of 10m for every KM (again as per garmin standards), this was tougher to ride as the climbs were longer.","imglocation":".images/atr1.jpg"}],"comments":[{"comment":"To effectively manage a national park unit and plan for its future, a basic understanding of a park's resources, values, and history is needed - a foundation for planning and management. These are called foundation documents. Foundation documents are at the core of each park's planning portfolio. ","name":"lekha"},{"comment":"while my Garmin with an altimeter (battery bonked at 160KM), showed around 1700m till 160k and the last part was mostly flat. So although the overall elevation was the normal Trivandrum standard of 10m for every KM (again as per garmin standards), this was tougher to ride as the climbs were longer.\r\n","name":"tuyru","file":"blog2.json"},{"comment":"aps shows overall elevation close to 2500m, while my Garmin with an altimeter (battery bonked at 160KM), showed around 1700m till 160k and the last part was mostly flat. So although the overall elevation was the normal Trivandrum standard of 10m for every KM (again as per garmin standards), this was tougher to ride as the climbs were longer.\r\n","name":"q","file":"blog2.json"},{"comment":" and down for the first 150 KM. The initial half was the most scenic and toughest terrain, mostly going through good country roads, near the Thenamala forest region. There were some long climbs, some might be CAT4, which extended for 1-2 KMs. The overall elevation, is always a matter of debate, as the GPS based maps shows overall elevation close to 2500m, while my Garmin with an altimeter (battery bonked at 160KM), showed around 1700m till 160k and the last part was mostly flat. So although the overall elevation was the normal Trivandrum standard of 10m for every KM (again as per garmin standards), this was tougher to ride as the climbs were longer.\r\n","name":"sas","file":"blog2.json"}]}