{"blogpage":[{"id":"013","heading":"Trivandrum Cyclathon 2017","para":"Trivandrum Cyclathon Champions Ride was more like a 40 km mass start race. A mass start race is a format where all riders start the race together and the one who crosses the finish line first is the winner. There was a good amount of prize money on offer too. Now, I am not a big fan of prize money racing, as many times riders cross the unwritten rules of fair racing, and also make dangerous moves for the money involved. It is not entirely correct to say, prize money attracts more participation. At best it might attract 2 or 3 more. The BBCH races have no prize money and still attract brilliant participation. In the last BBCH race, out of the top 8, seven positions were for riders who took an overnight train for Bangalore to race. It is the quality of race, organizing and competition that attracts riders. Without the prize money, the participation cost for everyone could have reduced to half. The course was around a 6.5 km loop, starting with a 2 km of flat stretch, a km of downhill, followed by some flat again and a 1.5 km climb and false flat, which is the most critical part of the course where accelerations and attacks were expected to happen, and ending in a flat stretch. It was a 6 lap race for 40km and unfortunately the finish was a right hander cutting through a road for full traffic, followed by a hump and followed by a less than 100 m straight with two more time mat humps to measure your time. It would be disastrous to do a full out sprint there and the organizers refused to change the finish despite we making several requests. Race was expected to compete between two main teams – Trivandrum Roadies club and the riders from Cochin Bikers Club. Sreenath from Cochin bikers was the hot favorite to win and he had a strong co-rider in Faizal PJ and a few more good team mates. We from Trivandrum roadies had decided to work for Renju and set him up for a winning attack in the last lap or the penultimate lap of the race. We expected Sreenath and team to attack very early in the race, as it is his usual way of racing. We wanted to just follow him in his attacks and attack him towards end of race, when we thought he will be relatively more tired.","imglocation":".images/atr1.jpg"}],"comments":[{"comment":"To effectively manage a national park unit and plan for its future, a basic understanding of a park's resources, values, and history is needed - a foundation for planning and management. These are called foundation documents. Foundation documents are at the core of each park's planning portfolio. ","name":"lekha"},{"comment":"ng co-rider in Faizal PJ and a few more good team mates. We from Trivandrum roadies had decided to work for Renju and set him up for a winning attack in the last lap or the penultimate lap of the race. We expected Sreenath and team to attack very early in the race, as it is his usual way of racing. We wanted to just follow him in his attacks and attack him towards end of race, when we thought he will be relatively more tired.\r\n\r\n\r\n","name":"lekha","file":"blog3.json"},{"comment":" the penultimate lap of the race. We expected Sreenath and team to attack very early in the race, as it is his usual way of racing. We wanted to just follow him in his attacks and attack him towards end of race, when we thought he will be relatively more tired.\r\n\r\n","name":"klfldf","file":"blog3.json"},{"comment":"d decided to work for Renju and set him up for a winning attack in the last lap or the penultimate lap of the race. We expected Sreenath and team to attack very early in the race, as it is his usual way of racing. We wanted to just follow him in his attacks and attack him towards end of race, when we thought he will be relatively more tired.\r\n","name":"asd","file":"blog3.json"}]}