{"blogpage":[{"name":"Ajith","heading":"My first full marathon","para":"Back in 2011, when I was working in Infosys, we got an email with the pics and details of Infosys runners who ran and finished the Standard Chartered Mumbai Full and Half Marathons. It included a colleague in my department (Nishant Sharma J) and one of our senior leaders. I wondered how on earth they ran 42 KMs!! Tried to imagine the distance and about running that distance, but it was beyond my comprehension. I regretted for being so out of shape, near about 100 kilos and couldn’t run even 100 meters. I thought of it as something which is definitely worth a try, but may be next life, if there is one. And left it there…\r\n\r\nFast forward to Dec 2013, I had gone through the moment of awakening and had got myself fit, a process which thousands of people go through at some stage of life and had taken cycling as my primary sport.  I ran the cochin half marathon after following a 1 month training plan in Nov-Dec 2013, with the help of Soles of Cochin and Tracs, Trivandrum.  The half marathon of 21.1 KM was an awesome experience and it was much easier than I thought and I finished earlier (2:09) than even my best estimates. I wanted to do a 30K next week itself and was looking at possible opportunities to run a full marathon. But the 30K never happened and as I started chasing various cycling goals my running took a back seat and I hardly ran.\r\n\r\nSometime mid of 2014, got to know that Soles of Cochin is organizing a full marathon in Nov and this was something which I didn’t want to miss. But I had cycling races in Aug and Sep, which meant I will hardly get around 6-7 weeks to train for a full marathon, which usually needs 12-16 weeks training especially if you weren’t running much.\r\n","file_id":"file_628ea286274a9"}],"comments":[{"comment":"30K never happened and as I started chasing various cycling goals my running took a back seat and I hardly ran. Sometime mid of 2014, got to know that Soles of Cochin is organizing a full marathon in Nov and this was something which I didn’t want to miss. But I had cycling races in Aug and Sep, which meant I will hardly get around 6-7 weeks to train for a full marathon, which usually needs 12-16 weeks training especially if you weren’t running much.\r\n\r\n","name":"Veena","file":"File_Json_628.json"},{"comment":"nizing a full marathon in Nov and this was something which I didn’t want to miss. But I had cycling races in Aug and Sep, which meant I will hardly get around 6-7 weeks to train for a full marathon, which usually needs 12-16 weeks training especially if you weren’t running much.\r\n","name":"anna","file":"File_Json_628.json"}]}