{"blogpage":[{"name":"Anoop","heading":"BBCH 97K Race: When the 'elites' chilled","para":"The Bangalore Biking Championship (BBCH) mass start race -  the second race of the season for the racing team from Trivandrum Bikers Club and its the best mass start race I can get in the year within a 1000 km radius of my part of the world. Cant afford to miss it and I signed up for the 97KM race for elite/masters and my junior team mate, Amal Razak was riding the 47KM race for U-18.\r\n\r\nI had raced the same race last year, and struggled to keep myself with the main peloto, eventually had got dropped at around 60KM. I had trained a bit since then and also upgraded to lighter wheels, so I was confident of finishing with the peloton. So for me the goals for this race were to ride more aggressively, stay towards the front of the peloton, try an attack or join attacks  etc.  (yeah I missed chasing down attacks in the goal list :)).\r\n\r\nThe race was flagged off at sharp 7AM and we started off on a very slow pace. A couple of riders were riding well ahead of the peloton and they were brought back within the first 5KM and the peloton was moving at an average of 32-33 for the first 10KM, while last year if I recall, we were going at around 38-40 right from word go.\r\n","file_id":"file_b34e777817354"}],"comments":[{"comment":"dadad","name":"dsdsd"},{"comment":"A couple of riders were riding well ahead of the peloton and they were brought back within the first 5KM and the peloton was moving at an average of 32-33 for the first 10KM, while last year if I recall, we were going at around 38-40 right from word go.\r\n","name":"truu","file":"File_Json_415.json"},{"comment":"asasront of the peloton, try an attack or join attacks etc. (yeah I missed chasing down attacks in the goal list :)). The race was flagged off at sharp 7AM and we started off on a very slow pace. A couple of riders were riding well ahead of the peloton and they were brought back within the first 5KM and the peloton was moving at an average of 32-33 for the first 10KM, while last year if I recall, we were going at around 38-40 right from word go.\r\n\r\n","name":"sas","file":"File_Json_415.json"},{"comment":"s were riding well ahead of the peloton and they were brought back within the first 5KM and the peloton was moving at an average of 32-33 for the first 10KM, while last year if I recall, we were going at around 38-40 right from word go.\r\n","name":"was","file":"File_Json_415.json"}]}